tap 'rcmdnk/file'
tap 'microsoft/mssql-release'
tap 'microsoft/git'
tap 'jandedobbeleer/oh-my-posh'
tap 'homebrew/services'
tap 'homebrew/bundle'
tap 'buo/cask-upgrade'
tap 'azure/functions'
mas 'Windows App (11.1.3)', id: 1295203466
mas 'Toggl Track (10.8.0)', id: 1291898086
mas 'Todoist (9.12.1)', id: 585829637
mas 'The Unarchiver (4.3.8)', id: 425424353
mas 'Save to Reader (0.16.8)', id: 1640236961
mas 'Save to Pocket (1.1)', id: 1477385213
mas 'Presentify (4.2.0)', id: 1507246666
mas 'Pocket (1.8.7)', id: 568494494
mas 'Pages (14.3)', id: 409201541
mas 'Magnet (3.0.6)', id: 441258766
mas 'IPTV Expert (8.1.2)', id: 1641944027
mas 'iMovie (10.4.3)', id: 408981434
mas 'Hue Essentials (4.2.7)', id: 1462943921
mas 'GhosteryLite (10.3.12)', id: 1436953057
mas 'Focus for YouTube (2.4)', id: 1514703160
mas 'DuckDuckGo Privacy for Safari (1.8.0)', id: 1482920575
mas 'DuckDuckGo (1.128.0)', id: 663592361
mas 'Brother iPrint&Scan (12.1.0)', id: 1193539993
mas 'Amphetamine (5.3.2)', id: 937984704
mas 'Amazon Kindle (7.27.1)', id: 302584613
mas '1Password for Safari (8.10.64)', id: 1569813296
cask 'zoom'
cask 'vlc'
cask 'visual-studio-code'
cask 'utm'
cask 'transmission'
cask 'thunderbird'
cask 'tabby'
cask 'syncthing'
cask 'slack'
cask 'shottr'
cask 'rocket'
cask 'powershell'
cask 'only-switch'
cask 'obsidian'
cask 'obs'
cask 'nordvpn'
cask 'ngrok'
cask 'mountain-duck'
cask 'miro'
cask 'microsoft-office'
cask 'microsoft-edge'
cask 'microsoft-azure-storage-explorer'
cask 'microsoft-auto-update'
cask 'mediainfo'
cask 'google-chrome'
cask 'github'
cask 'git-credential-manager'
cask 'gimp'
cask 'freedom'
cask 'font-fira-code-nerd-font'
cask 'font-caskaydia-cove-nerd-font'
cask 'font-cascadia-code'
cask 'excalidrawz'
cask 'elgato-video-capture'
cask 'dropbox'
cask 'dotnet-sdk'
cask 'discord'
cask 'daisydisk'
cask 'cyberduck'
cask 'cursor'
cask 'cryptomator'
cask 'choosy'
cask 'ccleaner'
cask 'brave-browser'
cask 'balenaetcher'
cask 'azure-data-studio'
cask 'affinity-photo@1'
cask '1password'
cask '1password-cli'
brew 'zstd'
brew 'yarn'
brew 'xz'
brew 'xorgproto'
brew 'wimlib'
brew 'webp'
brew 'unixodbc'
brew 'unbound'
brew 'tree-sitter'
brew 'transmission-cli'
brew 'tesseract'
brew 'tcl-tk'
brew 'sqlite'
brew 'sqlcmd'
brew 'ruby'
brew 'ruby-build'
brew 'readline'
brew 'rbenv'
brew 'qpdf'
brew 'python@3.13'
brew 'python@3.12'
brew 'python@3.11'
brew 'python-packaging'
brew 'poppler'
brew 'podman'
brew 'pkgconf'
brew 'pixman'
brew 'pinentry'
brew 'pcre2'
brew 'pango'
brew 'pandoc'
brew 'p11-kit'
brew 'openssl@3'
brew 'openjpeg'
brew 'openjdk@17'
brew 'ollama'
brew 'nss'
brew 'nspr'
brew 'npth'
brew 'node'
brew 'nettle'
brew 'msodbcsql18'
brew 'mpdecimal'
brew 'mono-libgdiplus'
brew 'miniupnpc'
brew 'mas'
brew 'm4'
brew 'lzo'
brew 'lz4'
brew 'little-cms2'
brew 'libyaml'
brew 'libxrender'
brew 'libxext'
brew 'libxdmcp'
brew 'libxcb'
brew 'libxau'
brew 'libx11'
brew 'libuv'
brew 'libusb'
brew 'libunistring'
brew 'libtool'
brew 'libtommath'
brew 'libtiff'
brew 'libtasn1'
brew 'libpng'
brew 'libnghttp2'
brew 'libksba'
brew 'libidn2'
brew 'libgpg-error'
brew 'libgcrypt'
brew 'libexif'
brew 'libevent'
brew 'libb2'
brew 'libassuan'
brew 'libarchive'
brew 'leptonica'
brew 'jpeg-turbo'
brew 'icu4c@76'
brew 'harfbuzz'
brew 'graphite2'
brew 'gpgme'
brew 'gnutls'
brew 'gnupg'
brew 'gmp'
brew 'glib'
brew 'giflib'
brew 'gettext'
brew 'fribidi'
brew 'freetype'
brew 'fontconfig'
brew 'cairo'
brew 'ca-certificates'
brew 'c-ares'
brew 'brotli'
brew 'brew-file'
brew 'autoconf'
# tap repositories and their packages
# App Store applications
